#include<iostream>
#include <string> 
using namespace std;
/*****************************************************************************
功能:存储输入的字符串

输入:字符串

输出:无

返回:0表示成功,其它返回-1
******************************************************************************/

int  AddString(char *strValue);
/****************************************************************************
功能:获取补位后的二维数组的长度

输入:无

输出:无

返回:二维数组长度
*****************************************************************************/

int  GetLength();


/*****************************************************************************
功能:将补位后的二维数组，与输入的二维数组做比较

输入:strInput:输入二维数组,iLen：输入的二维数组的长度

输出:无

返回:若相等,返回0;不相等,返回-1.其它:-1;
******************************************************************************/
int  ArrCmp(char strInput[][9],int iLen);

/*****************************************************************************
功能:主函数， 按长度为8拆分每个字符串后输出到新的字符串数组，长度不是8整数倍的字符串请在后面补数字0，空字符串不处理

输入:无 

输出:无

返回:成功伟0，异常为-1 
******************************************************************************/
int main()
{
	int num;
	cin>>num;
	string str[num];
	for(int i=0;i<num;i++)
	{
		cin>>str[i];
	}
	int i;
	string str1;
	str1={"hello"};
	i=GetLength(str1);
	for(int i=0;i<num;i++)
	{
		cout<<str[i]<<endl;
	}
	return 0;
}
int GetLength(char *strValue)
{
	int i=0;
	while(*(strValue+i)!='\0')
	{
		i++;
	}
	return i;
}

